-- 단과대
INSERT INTO college_table (college_id, college_name) VALUES
                                                         (1, '인문사회융합대학'),
                                                         (2, '경영공학대학'),
                                                         (3, '혁신공과대학'),
                                                         (4, '지능형SW융합대학'),
                                                         (5, '라이프케어사이언스대학'),
                                                         (6, '디자인앤아트대학'),
                                                         (7, '음악테크놀로지대학'),
                                                         (8, '문화예술융합대학'),
                                                         (9, '글로벌인재대학');

-- 학과
INSERT INTO major_table (major_name, college_id) VALUES
-- 인문사회융합대학
('인문사회융합대학', 1),
('인문학부', 1),
('국어국문학과', 1),
('사학과', 1),
('외국어학부', 1),
('영어영문학과', 1),
('프랑스어문학과', 1),
('러시아어문학과', 1),
('일어일문학과', 1),
('중어중문학과', 1),
('법행정학부', 1),
('법학과', 1),
('행정학과', 1),
('미디어커뮤니케이션학과', 1),
('소방행정학과', 1),

-- 경영공학대학
('경영학부', 2),
('경영학과', 2),
('글로벌비즈니스학과', 2),
('회계학과', 2),
('경제학부', 2),
('경제금융학과', 2),
('국제개발협력학과', 2),
('호텔관광학부', 2),
('호텔경영학과', 2),
('외식경영학과', 2),
('관광경영학과', 2),

-- 혁신공과대학
('바이오화학산업학부', 3),
('바이오공학및마케팅학과', 3),
('융합화학산업학과', 3),
('건설환경에너지공학부', 3),
('건설환경공학과', 3),
('환경에너지공학과', 3),
('건축도시부동산학부', 3),
('건축학과', 3),
('도시부동산학과', 3),
('산업및기계공학부', 3),
('산업공학과', 3),
('기계공학과', 3),
('반도체공학과', 3),
('전기전자공학부', 3),
('전기공학과', 3),
('전자공학과', 3),
('화학공학신소재공학부', 3),
('신소재공학과', 3),
('화학공학과', 3),

-- 지능형SW융합대학
('컴퓨터학부', 4),
('컴퓨터SW학과', 4),
('미디어SW학과', 4),
('정보통신학부', 4),
('정보통신학과', 4),
('정보보호학과', 4),
('데이터과학부', 4),

-- 라이프케어사이언스대학
('간호학과', 5),
('아동가족복지학과', 5),
('의류학과', 5),
('식품영양학과', 5),
('스포츠과학부', 5),
('체육학과', 5),
('레저스포츠학과', 5),
('운동건강관리학과', 5),

-- 디자인앤아트대학
('조형예술학부', 6),
('회화과', 6),
('조소과', 6),
('디자인학부', 6),
('커뮤니케이션디자인과', 6),
('패션디자인과', 6),
('공예디자인과', 6),

-- 음악테크놀로지대학
('아트앤테크놀로지작곡과', 7),
('성악과', 7),
('피아노과', 7),
('관현악과', 7),
('국악과', 7),

-- 문화예술융합대학
('아트앤엔터테인먼트학부', 8),
('영화술과', 8),
('연기예술과', 8),
('디지털콘텐츠과', 8),

-- 글로벌인재대학
('자유전공학부', 9);
